---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintX
source: html/ef00c2ee-e76d-cbc1-e757-34440b6f5bf6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintX Property

"X Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryLinearRestraintX { get; }
```